import Image from 'next/image'
import React from 'react'

const TermsAndConditions = () => {
    return (
        <div className='relative pt-32 md:pt-40 pb-6 bg-gradient-to-b from-[#E0DAFF] to-[#fff]'
            style={{
                // background: 'linear-gradient(224.16deg, #E0DAFF -2.22%, #FECDFB 112.2%)',
            }}>
            <Image src="/photos/terms-bg.svg" alt='Terms Background' width={100} height={100} className='absolute w-full inset-x-0 top-0 z-1' />
            <div className='max-w-7xl mx-auto px-4 md:px-0 relative z-2'>
                <div className='grid grid-cols-1 md:grid-cols-7 gap-8'>
                    <div className='md:col-span-2 '>
                        <div className='rounded-3xl overflow-hidden relative'>
                            <Image src="/photos/terms-img.svg" alt='Terms Background' width={100} height={100} className='w-full' />
                            <h3 className='text-3xl font-bold text-center px-6 absolute bottom-8 inset-x-0 z-4'
                                style={{
                                    background: 'linear-gradient(182.28deg, #301B69 36.46%, #B07CD1 97.83%)',
                                    WebkitBackgroundClip: 'text',
                                    WebkitTextFillColor: 'transparent',
                                    backgroundClip: 'text',
                                    color: 'transparent',
                                }}>نربط بين القلوب بنية الزواج، لا للتسالية</h3>
                            <div className='w-full h-12 bg-white -mt-4 relative z-2 text-3xl font-bold'
                                style={{
                                    boxShadow: "#fff 0px -20px 50px 80px"
                                }}></div>
                        </div>
                    </div>
                    <div className='md:col-span-5 flex flex-col items-start gap-4 md:gap-6 rounded-3xl p-6 shadow-lg'
                        style={{
                            background: 'linear-gradient(180deg, rgba(255, 255, 255, 0.54) 0%, rgba(255, 255, 255, 0.256) 100%)',
                        }}>
                        <h3 className='text-2xl md:text-4xl font-semibold'>شروط الاستخدام</h3>
                        <p className=' text-xl md:text-2xl leading-relaxed text-justify'>

                            بسم الله الرحمن الرحيم<br /> قال الله تعالى "<span className='font-bold'> وَأَوْفُواْ بِعَهْدِ اللهِ إِذَا عَاهَدتُّمْ وَلاَ تَنقُضُواْ الأَيْمَانَ بَعْدَ تَوْكِيدِهَا وَقَدْ جَعَلْتُمُ اللهَ عَلَيْكُمْ كَفِيلاً </span>" صدق الله العظيم

                        </p>
                        <p className=' text-lg font-semibold'>
                            عند إستخدامك للموقع فأنت تتعهد بالآتي:
                        </p>
                        <p className="text-lg leading-relaxed">
                            الموقع متاح لفئة البالغين من ١٨ عاما وأكثر، ولا يجوز استخدامه من قبل الأطفال والمراهقين. وعليه يتحمل المستخدم مصداقية إدخال البيانات الصادقة والصحيحة، ولا يتحمل الموقع أي مسؤولية تجاه استخدام الموقع من غير الفئة العمرية المسموحة. يتعهد المستخدم بمصداقية وصحة البيانات التي يقوم بإدخالها، ويتحمل كافة العواقب القانونية والأخلاقية والشرعية في حال مخالفة ذلك، ولا يتحمل الموقع إخلال المستخدم بهذا التعهد ولا يضمن الموقع نتيجة الزواج للمستخدمين.
                            <br />
                            تتعهد بعدم كتابة بيانات أو مراسلات غير جادة أو لا تتعلق بالزواج.
                            <br />
                            تتعهد بعدم استخدام الموقع للإساءة للموقع أو لأحد من أعضائه.
                            <br />
                            تتعهد بعدم كتابة بيانات أو مراسلة يوحي بانتقاص للآخرين بأي شكل. إذا كنت ترى أن صاحب الطلب غير مناسب لك يمكنك تجاهل المراسلة دون تجريح أو انتقاص.
                            <br />
                            يحصل الموقع على أتعاب من أي عضو يتزوج عن طريق الموقع، وهي أمانة في ذمته، مقدارها ألف ريال سعودي فقط، ويعتبر هذا الشرط اتفاقاً ملزماً.
                            <br />
                            تتعهد بعدم التسجيل بأكثر من عضوية تابعة لك في الموقع.
                            <br />
                            يمنع منعاً باتاً وضع أي عناوين اتصال في طلب التسجيل (بريد إلكتروني، رقم هاتف، رقم جوال، صندوق بريد، أو أي وسيلة تؤدي إلى التعارف خارج الموقع).
                            <br />
                            رقم الجوال والبريد الإلكتروني يظهر فقط لإدارة الموقع ولا يظهر للأعضاء أبداً.
                            <br />
                            يقوم المستخدم بدفع مبلغ اشتراك (إن وجد) لاستخدام خدمات موقع زواج إن، ويتم ذلك بشكل فوري إلكتروني دون تدخل بشري، ولا يحق للمستخدم بعد الدفع أن يطلب استرجاع مبلغ الاشتراك أو جزء منه لأي سبب كان. وفي حال قام المستخدم بحذف حسابه من الموقع فهذا يعني انتهاء اشتراكه فوراً وبدون استرجاع لمبلغ الاشتراك أو جزء منه بغض النظر عن المدة المتبقية، ولن يمكنه الدخول للموقع مرة أخرى إلا بالاشتراك والدفع من جديد.
                            <br />
                            الموقع ليس مسؤولاً عن أي محتوى أو مخالفات داخل الموقع من قبل المستخدمين، ويحق للموقع حذف أو تعطيل أي حساب أو محتوى بشكل كامل أو جزئي، مؤقتاً أو دائماً إذا كان مخالفاً لشروط الاستخدام أو ارتكب محظوراً، أو بدون أي سبب منصوص إذا ارتأت المصلحة في ذلك، وبدون الرجوع للمستخدم وموافقته. ويحق للموقع تصحيح المعلومات المدخلة المغلوطة من المستخدم بطلب منه أو بدون طلبه، أو تعديل المواد المخالفة للأحكام والشروط وبدون الرجوع للمستخدم. لا يقدم الموقع أي تعهدات أو ضمانات من أي نوع بشأن المحتوى وتشغيل الموقع أو توافق المستخدمين أو الزواج أو غير ذلك.
                            <br />
                            يحق لإدارة الموقع إيقاف أو تعليق أي حساب لا تتأكد من جديته ولا يتم إرجاع أي مبالغ تم سدادها للموقع.
                            <br />
                            يهتم الموقع بشكل كبير بخصوصية المستخدمين، وعدم وجود أي عنصر بشري مطّلع على محتوى المحادثات الخاصة. رغم الاهتمام بخصوصية المستخدمين دائماً وتصميم الموقع بطريقة آمنة للحفاظ على السرية والخصوصية، إلا أن الموقع لا يضمن سوء تداول المستخدمين لمعلومات الدخول أو أجهزتهم مع آخرين، أو حدوث خلل تقني أو اختراق أو خطأ كما هو وارد في أي موقع تقني. يحق للموقع استخدام البريد الإلكتروني أو مكالمات أو رسائل الجوال أو برنامج واتساب باعتباره وسيلة أساسية للتواصل أو الإعلان.
                            <br />
                            يحتفظ الموقع بالحق بتعديل أو تغيير الشروط والأحكام في أي وقت وبدون الرجوع للمستخدم، وذلك عبر تحديثها في صفحة الموقع. يُعتبر استمرار الاستخدام للموقع بعد تاريخ التحديث للشروط والأحكام إقراراً من المستخدم بالموافقة على النسخة المحدثة من الشروط والأحكام فور نشرها.
                        </p>
                    </div>
                </div>
            </div>
        </div>
    )
}

export default TermsAndConditions